SPPR_Test/src/Enums/СрочностьИсправленияОшибок/СрочностьИсправленияОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СрочностьИсправленияОшибок</name>
  <enumValues>
    <name>Немедленно</name>
  </enumValues>
  <enumValues>
    <name>ЖелательноБыстрее</name>
  </enumValues>
  <enumValues>
    <name>ВПлановомПорядке</name>
  </enumValues>
</mdclass:Enum>

SPPR_Test/src/Enums/МетодыВыявленияОшибок/МетодыВыявленияОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыВыявленияОшибок</name>
  <enumValues>
    <name>РаботаСПрограммой</name>
  </enumValues>
  <enumValues>
    <name>АудитКода</name>
  </enumValues>
  <enumValues>
    <name>Автотесты</name>
  </enumValues>
</mdclass:Enum>

SPPR_Test/src/Catalogs/ВерсииПроекта/ВерсииПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииПроекта</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ВерсияМеханизмаОбновленияИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформыХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ветка</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВключенияБиблиотек</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовностиКПредварительномуВстраиванию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВнешнегоТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <comment>Начало разработки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРазработки</name>
    <comment>Окончание разработки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредстоящейСборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрекращенияПоддержки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяИБДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяХранилищаДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИБДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодредакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРедакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьКонфигурациюИзХранилищаПриЗагрузкеМетаданных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяИБДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяХранилищаДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПубликуемыйНомерВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПатчи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВерсииВключаемыхПроектов</name>
    <attributes>
      <name>Версия</name>
      <type>
        <types>CatalogRef.ВерсииПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтличияВИменахМетаданных</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтличияВСоставеПодсистем</name>
    <attributes>
      <name>Подсистема</name>
      <type>
        <types>CatalogRef.Подсистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектНужноДобавитьВПодсистему</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SPPR_Test/src/Catalogs/СборкиВерсии/СборкиВерсии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СборкиВерсии</name>
  <owners>Catalog.ВерсииПроекта</owners>
  <attributes>
    <name>ДатаСборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Опубликована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСборокВерсииПроекта</types>
    </type>
  </attributes>
  <attributes>
    <name>РекомендуемаяВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныВыпуска</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликуемыйНомерСборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасположениеДистрибутива</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасположениеПубликации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ветка</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СборкиВключаемыхПроектов</name>
    <attributes>
      <name>Сборка</name>
      <type>
        <types>CatalogRef.СборкиВерсии</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбновлениеДляСборок</name>
    <attributes>
      <name>Сборка</name>
      <type>
        <types>CatalogRef.СборкиВерсии</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SPPR_Test/src/CommonModules/РегистрацияОшибок/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработать отчет об ошибке.
// 
// Параметры:
//  ДанныеОтчета - Двоичные данные архива (.zip, Multipart) с данными ошибки 
Процедура ОбработатьОтчетОбОшибке(ДанныеОтчета) Экспорт
	
	ИнформацияОтчетаСтруктура 	= ПолучитьИнформациюИзОтчета(ДанныеОтчета);
	СтруктураОтчета = ИнформацияОтчетаСтруктура.ReportStructure;
	
	Если СтруктураОтчета = Неопределено Тогда
		ВызватьИсключение("Не удалось разобрать протокол ошибки!");	
	КонецЕсли;
	
	Project = СтруктураОтчета.configInfo.name;
	
	ОшибкаМассив =  СтруктураОтчета.errorInfo.applicationErrorInfo.errors;
	Если ОшибкаМассив.Количество() И ЗначениеЗаполнено(ОшибкаМассив[0][0]) Тогда	
		SourceInformation = ОшибкаМассив[0][0];
		Description = ПолучитьСтрокуМетаданных(ОшибкаМассив[0][0]);
	Иначе
		ВызватьИсключение("Не заполнен текст ошибки!");	
	КонецЕсли;
	
	Если СтруктураОтчета.Свойство("additionalInfo") Тогда // Доп инфомрация - она же идентификатор клиента
		Description = СтруктураОтчета.additionalInfo + " " + Description;	
	КонецЕсли;
	
	StepsToReproduce = "";
	Если СтруктураОтчета.errorInfo.Свойство("userDescription") Тогда
		StepsToReproduce = СтруктураОтчета.errorInfo.userDescription;
	КонецЕсли;
	
	ВерсияПроекта = СтруктураОтчета.configInfo.version;
	ProjectVersion = Справочники.ВерсииПроекта.ПолучитьВерсиюПроектаПоНомеру(Project, ВерсияПроекта);
	Если ProjectVersion = Неопределено Тогда
		ВызватьИсключение("Не удалось найти версию проекта: " + ВерсияПроекта);
	КонецЕсли;
	Assembly = Строка(Справочники.СборкиВерсии.ФинальнаяСборкаВерсии(ProjectVersion)); 
	Если Assembly = Неопределено Тогда
		ВызватьИсключение("Не удалось найти финальную сборку!");	
	КонецЕсли;
	
	Urgency = Перечисления.СрочностьИсправленияОшибок.ВПлановомПорядке;
	DetectionType = Перечисления.МетодыВыявленияОшибок.РаботаСПрограммой;
	Responsible = Константы.ПолучательОшибок.Получить();
	
	ТаблицаМетаданных = ИнтеграцияСВнешнимиСистемами.ПолучитьТаблицуМетаданных();
	ОбъектыМетаданных = ИнтеграцияСВнешнимиСистемами.НайтиОбъектыМетаданных(ТаблицаМетаданных, Project);
	ПараметрыОшибки   = ИнтеграцияСВнешнимиСистемами.ИнициироватьПараметрыОшибки();
	
	ПараметрыОшибки.ИмяПроекта               = Project;
	ПараметрыОшибки.Наименование             = Description;
	ПараметрыОшибки.Сборка             		 = Assembly;
	ПараметрыОшибки.МетодВыявленияОшибки     = DetectionType;
	ПараметрыОшибки.ИсходнаяИнформация       = SourceInformation;
	ПараметрыОшибки.ПорядокВоспроизведения   = StepsToReproduce;
	ПараметрыОшибки.ДатаОбнаружения          = ТекущаяДатаСеанса();
	ПараметрыОшибки.ВерсияПроекта            = ProjectVersion;
	ПараметрыОшибки.СрочностьИсправления     = Urgency;
	ПараметрыОшибки.КомуНаправлена           = Responsible;
	ПараметрыОшибки.ОшибкаЗарегистрированаПоИнформацииОтВнешнихИсточников = Истина;
	
	Результат = ИнтеграцияСВнешнимиСистемами.ЗарегистрироватьОшибку(ПараметрыОшибки, ОбъектыМетаданных);   
	Если Результат.СсылкаНаОшибку <> Неопределено Тогда
		ВладелецФайла = Результат.СсылкаНаОшибку; 	
	Иначе
		ВладелецФайла = Константы.ПапкаФайловДляОшибок.Получить();	
	КонецЕсли;
	НовыйАрхив = ПерекомпоноватьZip(ДанныеОтчета);
	РаботаСФайлами.ЗагрузитьДвоичныеДанныеВФайлы(НовыйАрхив, "Ошибка_"+Формат(ТекущаяДатаСеанса(), "ДФ=dd_MM_yyyy;"), ".zip", ВладелецФайла);
КонецПроцедуры

// Перекомпоновать zip. Для моментов когда данные передаются в виде Multipart 
// 
// Параметры:
//  ДанныеОтчета - двоичные данные - Данные отчета 
// 
// Возвращаемое значение:
//  ДвоичныеДанные - Данные нового zip архива
Функция ПерекомпоноватьZip(ДанныеОтчета) Экспорт

    ЧтениеZip = Новый ЧтениеZipФайла(ДанныеОтчета.ОткрытьПотокДляЧтения());
    ПотокНовогоАрхива = Новый ПотокВПамяти;
    ЗаписьZip = Новый ЗаписьZipФайла(ПотокНовогоАрхива);

    ПутьКПапке = КаталогВременныхФайлов() + СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
    СоздатьКаталог(ПутьКПапке);
    
    ЧтениеZip.ИзвлечьВсе(ПутьКПапке, РежимВосстановленияПутейФайловZIP.Восстанавливать);

    Для Каждого Элемент Из ЧтениеZip.Элементы Цикл
        
        ПолныйПутьНаДиске = ПутьКПапке + ПолучитьРазделительПути() + Элемент.ПолноеИмя;
        ЗаписьZip.Добавить(ПолныйПутьНаДиске, РежимСохраненияПутейZIP.СохранятьОтносительныеПути);
        
    КонецЦикла;

    ЗаписьZip.Записать(); 
    ЧтениеZip.Закрыть();

    УдалитьФайлы(ПутьКПапке);

    Возврат ПотокНовогоАрхива.ЗакрытьИПолучитьДвоичныеДанные();
    
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Функция возвращает строковое представление объекта метаданных
//
// Параметры:
//  ТекстОшибки  - Строка - Исходная строка текста ошибки
//
// Возвращаемое значение:
//   Строка   - Строка объекта метаданных
//
Функция ПолучитьСтрокуМетаданных(ТекстОшибки)
 
	ПерваяФигурнаяСкопка 	= СтрНайти(ТекстОшибки, Символ(123));
	ВтораяФигурнаяСкопка 	= СтрНайти(ТекстОшибки, Символ(125));
	РезультатПоиска		    = Строка(Сред(ТекстОшибки, (ПерваяФигурнаяСкопка+1), (ВтораяФигурнаяСкопка-(ПерваяФигурнаяСкопка+1)))); 
	СтрокаОбъектаМетаданных = СтрРазделить(РезультатПоиска, ".");	
	
	Возврат СтрокаОбъектаМетаданных[0] + "." + СтрокаОбъектаМетаданных[1];
	
КонецФункции


Функция ПолучитьИнформациюИзОтчета(ДанныеОтчета)
	
	Отчет 		   = Неопределено;
	ОтчетСтруктура = Неопределено;
	Скриншот 	   = Неопределено;
			
	ЧтениеZip = Новый ЧтениеZipФайла(ДанныеОтчета.ОткрытьПотокДляЧтения());
	Для Каждого Элемент Из ЧтениеZip.Элементы Цикл 
		Если Элемент.Имя = "report.json" Тогда
			ПутьКПапкеReportJson = ПолучитьИмяВременногоФайла();
			ЧтениеZip.Извлечь(Элемент, ПутьКПапкеReportJson);
			
			ЧтениеТекста = Новый ЧтениеТекста(ПутьКПапкеReportJson + ПолучитьРазделительПути() + "report.json", КодировкаТекста.UTF8);
			Отчет = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();
			
			ЧтениеJson = Новый ЧтениеJSON();
			ЧтениеJson.ОткрытьФайл(ПутьКПапкеReportJson + ПолучитьРазделительПути() + "report.json");
			ОтчетСтруктура = ПрочитатьJSON(ЧтениеJson);			
			ЧтениеJson.Закрыть();
			
			УдалитьФайлы(ПутьКПапкеReportJson);
		ИначеЕсли Элемент.Имя = "screenshot.png" Тогда
			ПутьКПапкеScreenshot = ПолучитьИмяВременногоФайла();
			
			ЧтениеZip.Извлечь(Элемент, ПутьКПапкеScreenshot);  		
			ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКПапкеScreenshot + ПолучитьРазделительПути() + "screenshot.png");
			Скриншот 	   = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
			
			УдалитьФайлы(ПутьКПапкеScreenshot);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Report, ReportStructure, Screenshot", Отчет, ОтчетСтруктура, Скриншот); 
	
КонецФункции
	

#КонецОбласти
